DanielM718/ESP32-home-sensor-hub/esp/ESP32C3_SHT41_node/main/main.c
#include <stdio.h>
#include <stdint.h>
#include <string.h>

#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include "freertos/task.h"

#include "nvs.h"
#include "nvs_flash.h"
#include "esp_event.h"
#include "esp_netif.h"
#include "esp_wifi.h"
#include "esp_log.h"
#include "esp_now.h"
#include "esp_mac.h"
#include "esp_err.h"
#include "esp_random.h"
#include "esp_sleep.h"

#include "driver/gpio.h"
#include "driver/i2c_master.h"
#include "esp_adc/adc_cali.h"
#include "esp_adc/adc_cali_scheme.h"
#include "esp_adc/adc_oneshot.h"
#include "espnow_channel_recovery.h"

#define NODE_ID 1//4
#define BATTERY_MONITOR_ENABLED 0
#define NORMAL_SLEEP_SECONDS UINT32_C(900)
#define ESPNOW_SEND_TIMEOUT_MS 500
#define DISCOVERY_RESPONSE_TIMEOUT_MS 300
#define CHANNEL_SETTLE_MS 10
#define CHANNEL_CACHE_NAMESPACE "espnow"
#define CHANNEL_CACHE_KEY "channel"

// Seeed XIAO ESP32-C3 common I2C pins are D4/SDA = GPIO6 and D5/SCL = GPIO7.
// Verify these match your wiring before flashing.
#define I2C_SDA_GPIO GPIO_NUM_6
#define I2C_SCL_GPIO GPIO_NUM_7
#define I2C_FREQ_HZ 100000
#define I2C_XFER_TIMEOUT_MS 100

#define BATTERY_ADC_GPIO GPIO_NUM_2
#define BATTERY_ADC_UNIT ADC_UNIT_1
#define BATTERY_ADC_CHANNEL ADC_CHANNEL_2
#define BATTERY_ADC_ATTEN ADC_ATTEN_DB_12
#define BATTERY_R_TOP_OHMS UINT64_C(1000000)
#define BATTERY_R_BOTTOM_OHMS UINT64_C(1000000)
#define BATTERY_ADC_SAMPLE_COUNT 32U
#define BATTERY_ADC_DISCARD_COUNT 4U
#define BATTERY_ADC_SETTLE_MS 10U
#define BATTERY_LOW_MV 3400
#define BATTERY_SHUTDOWN_MV 3200
#define BATTERY_ABSOLUTE_MIN_MV 2500
#define BATTERY_LOW_CONFIRMATION_COUNT 2

#define USER_LED_GPIO GPIO_NUM_10
#define SHT41_I2C_ADDR 0x44
#define SHT41_CMD_HIGH_PRECISION_NO_HEATER 0xFD
#define SHT41_MEASUREMENT_DELAY_MS 30

#define STATUS_SHT41_OK BIT0
#define STATUS_ESPNOW_SEND_ATTEMPTED BIT1
#define STATUS_BATTERY_OK BIT2
#define STATUS_BATTERY_LOW BIT3
#define STATUS_BATTERY_SHUTDOWN BIT4

static const char *TAG = "ESP32NOW_node";

// Gateway/master ESP32 STA MAC address
static const uint8_t gateway_mac[ESP_NOW_ETH_ALEN] = {
    0xd8, 0xbc, 0x38, 0xe5, 0x78, 0x8c
};

typedef struct __attribute__((packed)) {
    uint32_t node_id;
    uint32_t sequence;
    float temp_c;
    float rh;
    uint16_t battery_mv;
    uint32_t status_flags;
} sensor_packet_t;

_Static_assert(sizeof(sensor_packet_t) == 22, "sensor_packet_t wire size changed");

RTC_DATA_ATTR static uint32_t sequence_number = 0;
RTC_DATA_ATTR static uint8_t low_battery_reading_count = 0;
RTC_DATA_ATTR static uint8_t rtc_gateway_channel = 0;
RTC_DATA_ATTR static uint8_t rtc_persisted_gateway_channel = 0;
RTC_DATA_ATTR static uint8_t recovery_failure_count = 0;

static i2c_master_bus_handle_t i2c_bus;
static i2c_master_dev_handle_t sht41_dev;
static SemaphoreHandle_t espnow_send_sem;
static SemaphoreHandle_t discovery_response_sem;
static esp_now_send_status_t last_send_status = ESP_NOW_SEND_FAIL;
static volatile bool discovery_response_expected = false;
static volatile uint32_t expected_discovery_nonce = 0;
static volatile uint8_t discovered_gateway_channel = 0;
static uint8_t persisted_gateway_channel = 0;

static void on_espnow_send(const esp_now_send_info_t *tx_info,
                           esp_now_send_status_t status)
{
    ESP_LOGD(TAG, "Send to " MACSTR " status: %s",
             MAC2STR(tx_info->des_addr),
             status == ESP_NOW_SEND_SUCCESS ? "success" : "fail");

    last_send_status = status;
    if (espnow_send_sem != NULL) {
        xSemaphoreGive(espnow_send_sem);
    }
}

static void on_espnow_recv(const esp_now_recv_info_t *recv_info,
                           const uint8_t *data, int len)
{
    espnow_discovery_response_t response;

    if (recv_info == NULL || data == NULL || len <= 0 ||
        !discovery_response_expected ||
        memcmp(recv_info->src_addr, gateway_mac, ESP_NOW_ETH_ALEN) != 0 ||
        !espnow_discovery_response_matches(data, (size_t)len, NODE_ID,
                                           expected_discovery_nonce,
                                           &response)) {
        return;
    }

    discovered_gateway_channel = response.channel;
    discovery_response_expected = false;
    if (discovery_response_sem != NULL) {
        xSemaphoreGive(discovery_response_sem);
    }
}

static uint8_t sht41_crc8(const uint8_t *data, size_t len)
{
    uint8_t crc = 0xFF;

    for (size_t i = 0; i < len; i++) {
        crc ^= data[i];
        for (int bit = 0; bit < 8; bit++) {
            if ((crc & 0x80) != 0) {
                crc = (uint8_t)((crc << 1) ^ 0x31);
            } else {
                crc <<= 1;
            }
        }
    }

    return crc;
}

#if BATTERY_MONITOR_ENABLED
static esp_err_t battery_calibration_create(adc_cali_handle_t *out_handle)
{
    if (out_handle == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    *out_handle = NULL;

#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
    adc_cali_curve_fitting_config_t config = {
        .unit_id = BATTERY_ADC_UNIT,
        .chan = BATTERY_ADC_CHANNEL,
        .atten = BATTERY_ADC_ATTEN,
        .bitwidth = ADC_BITWIDTH_DEFAULT,
    };
    return adc_cali_create_scheme_curve_fitting(&config, out_handle);
#elif ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
    adc_cali_line_fitting_config_t config = {
        .unit_id = BATTERY_ADC_UNIT,
        .atten = BATTERY_ADC_ATTEN,
        .bitwidth = ADC_BITWIDTH_DEFAULT,
    };
    return adc_cali_create_scheme_line_fitting(&config, out_handle);
#else
    ESP_LOGE(TAG, "No ADC calibration scheme is available for this target");
    return ESP_ERR_NOT_SUPPORTED;
#endif
}

static esp_err_t battery_calibration_delete(adc_cali_handle_t handle)
{
#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
    return adc_cali_delete_scheme_curve_fitting(handle);
#elif ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
    return adc_cali_delete_scheme_line_fitting(handle);
#else
    (void)handle;
    return ESP_ERR_NOT_SUPPORTED;
#endif
}

static esp_err_t battery_read_mv(uint16_t *battery_mv)
{
    if (battery_mv == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    *battery_mv = 0;

    adc_oneshot_unit_handle_t adc_handle = NULL;
    adc_cali_handle_t cali_handle = NULL;
    esp_err_t err;
    uint64_t calibrated_mv_sum = 0;
    uint64_t midpoint_mv = 0;
    uint64_t calculated_battery_mv = 0;
    uint16_t result_mv = 0;
    unsigned int valid_samples = 0;

    adc_unit_t mapped_unit;
    adc_channel_t mapped_channel;
    err = adc_oneshot_io_to_channel(BATTERY_ADC_GPIO, &mapped_unit, &mapped_channel);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Battery ADC GPIO%d mapping lookup failed: %s",
                 BATTERY_ADC_GPIO, esp_err_to_name(err));
        return err;
    }
    if (mapped_unit != BATTERY_ADC_UNIT || mapped_channel != BATTERY_ADC_CHANNEL) {
        ESP_LOGE(TAG,
                 "Battery ADC mapping mismatch: GPIO%d maps to unit %d channel %d, expected unit %d channel %d",
                 BATTERY_ADC_GPIO, mapped_unit + 1, mapped_channel,
                 BATTERY_ADC_UNIT + 1, BATTERY_ADC_CHANNEL);
        return ESP_ERR_INVALID_STATE;
    }

    adc_oneshot_unit_init_cfg_t unit_config = {
        .unit_id = BATTERY_ADC_UNIT,
        .ulp_mode = ADC_ULP_MODE_DISABLE,
    };
    err = adc_oneshot_new_unit(&unit_config, &adc_handle);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Battery ADC unit initialization failed: %s", esp_err_to_name(err));
        goto cleanup;
    }

    adc_oneshot_chan_cfg_t channel_config = {
        .atten = BATTERY_ADC_ATTEN,
        .bitwidth = ADC_BITWIDTH_DEFAULT,
    };
    err = adc_oneshot_config_channel(adc_handle, BATTERY_ADC_CHANNEL, &channel_config);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Battery ADC channel configuration failed: %s", esp_err_to_name(err));
        goto cleanup;
    }

