DanielM718/ESP32-home-sensor-hub/esp/ESP32C3_SHT41_node/main/main.c
    err = battery_calibration_create(&cali_handle);
    if (err != ESP_OK) {
        ESP_LOGE(TAG,
                 "Battery ADC calibration unavailable; refusing uncalibrated conversion: %s",
                 esp_err_to_name(err));
        goto cleanup;
    }

    vTaskDelay(pdMS_TO_TICKS(BATTERY_ADC_SETTLE_MS));

    for (unsigned int i = 0; i < BATTERY_ADC_DISCARD_COUNT; i++) {
        int raw;
        err = adc_oneshot_read(adc_handle, BATTERY_ADC_CHANNEL, &raw);
        if (err != ESP_OK) {
            ESP_LOGE(TAG, "Battery ADC discarded sample %u failed: %s",
                     i + 1U, esp_err_to_name(err));
            goto cleanup;
        }
    }

    for (unsigned int i = 0; i < BATTERY_ADC_SAMPLE_COUNT; i++) {
        int raw;
        int calibrated_mv;

        err = adc_oneshot_read(adc_handle, BATTERY_ADC_CHANNEL, &raw);
        if (err != ESP_OK) {
            ESP_LOGE(TAG, "Battery ADC sample %u failed after %u valid samples: %s",
                     i + 1U, valid_samples, esp_err_to_name(err));
            goto cleanup;
        }

        err = adc_cali_raw_to_voltage(cali_handle, raw, &calibrated_mv);
        if (err != ESP_OK) {
            ESP_LOGE(TAG, "Battery ADC calibration conversion failed for sample %u: %s",
                     i + 1U, esp_err_to_name(err));
            goto cleanup;
        }
        if (calibrated_mv < 0) {
            ESP_LOGE(TAG, "Battery ADC calibration returned negative voltage: %d mV",
                     calibrated_mv);
            err = ESP_ERR_INVALID_RESPONSE;
            goto cleanup;
        }

        calibrated_mv_sum += (uint64_t)calibrated_mv;
        valid_samples++;
    }

    midpoint_mv = (calibrated_mv_sum + (BATTERY_ADC_SAMPLE_COUNT / 2U)) /
                  BATTERY_ADC_SAMPLE_COUNT;
    calculated_battery_mv =
        (midpoint_mv * (BATTERY_R_TOP_OHMS + BATTERY_R_BOTTOM_OHMS) +
         (BATTERY_R_BOTTOM_OHMS / 2U)) /
        BATTERY_R_BOTTOM_OHMS;
    result_mv = calculated_battery_mv > UINT16_MAX
                    ? UINT16_MAX
                    : (uint16_t)calculated_battery_mv;
    err = ESP_OK;

cleanup:
    if (cali_handle != NULL) {
        esp_err_t cleanup_err = battery_calibration_delete(cali_handle);
        if (cleanup_err != ESP_OK) {
            ESP_LOGE(TAG, "Battery ADC calibration cleanup failed: %s",
                     esp_err_to_name(cleanup_err));
            if (err == ESP_OK) {
                err = cleanup_err;
            }
        }
    }
    if (adc_handle != NULL) {
        esp_err_t cleanup_err = adc_oneshot_del_unit(adc_handle);
        if (cleanup_err != ESP_OK) {
            ESP_LOGE(TAG, "Battery ADC unit cleanup failed: %s", esp_err_to_name(cleanup_err));
            if (err == ESP_OK) {
                err = cleanup_err;
            }
        }
    }

    if (err != ESP_OK) {
        return err;
    }

    *battery_mv = result_mv;
    ESP_LOGI(TAG,
             "Battery ADC: midpoint=%llu mV whole_battery=%u mV valid_samples=%u calibrated=yes",
             (unsigned long long)midpoint_mv, (unsigned int)*battery_mv, valid_samples);

    if (*battery_mv > 4300U) {
        ESP_LOGW(TAG, "Battery reading is suspicious; check wiring and calibration: %u mV",
                 (unsigned int)*battery_mv);
    }

    return ESP_OK;
}
#endif

static esp_err_t i2c_init(void)
{
    i2c_master_bus_config_t bus_config = {
        .clk_source = I2C_CLK_SRC_DEFAULT,
        .i2c_port = I2C_NUM_0,
        .sda_io_num = I2C_SDA_GPIO,
        .scl_io_num = I2C_SCL_GPIO,
        .glitch_ignore_cnt = 7,
        .flags.enable_internal_pullup = true,
    };
    esp_err_t err = i2c_new_master_bus(&bus_config, &i2c_bus);
    if (err != ESP_OK) {
        return err;
    }

    i2c_device_config_t dev_config = {
        .dev_addr_length = I2C_ADDR_BIT_LEN_7,
        .device_address = SHT41_I2C_ADDR,
        .scl_speed_hz = I2C_FREQ_HZ,
    };
    err = i2c_master_bus_add_device(i2c_bus, &dev_config, &sht41_dev);
    if (err != ESP_OK) {
        return err;
    }

    ESP_LOGI(TAG, "I2C initialized: SDA GPIO%d, SCL GPIO%d, %d Hz",
             I2C_SDA_GPIO, I2C_SCL_GPIO, I2C_FREQ_HZ);
    return ESP_OK;
}

static esp_err_t sht41_probe(void)
{
    esp_err_t err = i2c_master_probe(i2c_bus, SHT41_I2C_ADDR, I2C_XFER_TIMEOUT_MS);
    if (err == ESP_OK) {
        ESP_LOGI(TAG, "SHT41 probe OK at I2C address 0x%02x", SHT41_I2C_ADDR);
    } else {
        ESP_LOGW(TAG, "SHT41 probe failed at I2C address 0x%02x: %s",
                 SHT41_I2C_ADDR, esp_err_to_name(err));
    }

    return err;
}

static esp_err_t sht41_read(float *temp_c, float *rh)
{
    uint8_t command = SHT41_CMD_HIGH_PRECISION_NO_HEATER;
    uint8_t data[6] = {0};
    esp_err_t err = i2c_master_transmit(sht41_dev, &command, sizeof(command),
                                        I2C_XFER_TIMEOUT_MS);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "SHT41 command transmit failed: %s", esp_err_to_name(err));
        return err;
    }

    vTaskDelay(pdMS_TO_TICKS(SHT41_MEASUREMENT_DELAY_MS));

    err = i2c_master_receive(sht41_dev, data, sizeof(data), I2C_XFER_TIMEOUT_MS);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "SHT41 measurement receive failed after %d ms delay: %s",
                 SHT41_MEASUREMENT_DELAY_MS, esp_err_to_name(err));
        return err;
    }

    if (sht41_crc8(&data[0], 2) != data[2]) {
        ESP_LOGE(TAG, "SHT41 temperature CRC mismatch: got=0x%02x expected=0x%02x",
                 data[2], sht41_crc8(&data[0], 2));
        return ESP_ERR_INVALID_CRC;
    }

    if (sht41_crc8(&data[3], 2) != data[5]) {
        ESP_LOGE(TAG, "SHT41 humidity CRC mismatch: got=0x%02x expected=0x%02x",
                 data[5], sht41_crc8(&data[3], 2));
        return ESP_ERR_INVALID_CRC;
    }

    uint16_t raw_temp = ((uint16_t)data[0] << 8) | data[1];
    uint16_t raw_rh = ((uint16_t)data[3] << 8) | data[4];

    *temp_c = -45.0f + (175.0f * (float)raw_temp / 65535.0f);
    *rh = -6.0f + (125.0f * (float)raw_rh / 65535.0f);

