DanielM718/ESP32-home-sensor-hub/esp/ESP32C3_SHT41_node/main/main.c
    if (*rh < 0.0f) {
        *rh = 0.0f;
    } else if (*rh > 100.0f) {
        *rh = 100.0f;
    }

    return ESP_OK;
}

static uint8_t load_gateway_channel(void)
{
    if (espnow_channel_is_valid(rtc_gateway_channel) &&
        espnow_channel_is_valid(rtc_persisted_gateway_channel)) {
        persisted_gateway_channel = rtc_persisted_gateway_channel;
        ESP_LOGI(TAG, "Using RTC cached gateway channel %u",
                 (unsigned int)rtc_gateway_channel);
        return rtc_gateway_channel;
    }

    nvs_handle_t handle;
    uint8_t nvs_channel = 0;
    esp_err_t err = nvs_open(CHANNEL_CACHE_NAMESPACE, NVS_READONLY, &handle);

    if (err == ESP_OK) {
        err = nvs_get_u8(handle, CHANNEL_CACHE_KEY, &nvs_channel);
        nvs_close(handle);
        if (err == ESP_OK) {
            if (espnow_channel_is_valid(nvs_channel)) {
                persisted_gateway_channel = nvs_channel;
                rtc_persisted_gateway_channel = nvs_channel;
            } else {
                ESP_LOGW(TAG, "Ignoring out-of-range NVS channel %u",
                         (unsigned int)nvs_channel);
            }
        } else if (err != ESP_ERR_NVS_NOT_FOUND) {
            ESP_LOGW(TAG, "Ignoring invalid channel cache: %s", esp_err_to_name(err));
        }
    } else if (err != ESP_ERR_NVS_NOT_FOUND) {
        ESP_LOGW(TAG, "Unable to open channel cache: %s", esp_err_to_name(err));
    }

    if (espnow_channel_is_valid(rtc_gateway_channel)) {
        ESP_LOGI(TAG, "Using RTC cached gateway channel %u",
                 (unsigned int)rtc_gateway_channel);
        return rtc_gateway_channel;
    }
    if (espnow_channel_is_valid(persisted_gateway_channel)) {
        rtc_gateway_channel = persisted_gateway_channel;
        ESP_LOGI(TAG, "Using NVS cached gateway channel %u",
                 (unsigned int)rtc_gateway_channel);
        return rtc_gateway_channel;
    }

    ESP_LOGI(TAG, "No valid cached gateway channel; discovery required");
    return 0;
}

static void cache_gateway_channel(uint8_t working_channel)
{
    if (!espnow_channel_is_valid(working_channel)) {
        return;
    }

    rtc_gateway_channel = working_channel;
    if (!espnow_channel_cache_needs_write(persisted_gateway_channel,
                                          working_channel)) {
        return;
    }

    nvs_handle_t handle;
    esp_err_t err = nvs_open(CHANNEL_CACHE_NAMESPACE, NVS_READWRITE, &handle);
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "Unable to open channel cache for update: %s",
                 esp_err_to_name(err));
        return;
    }

    err = nvs_set_u8(handle, CHANNEL_CACHE_KEY, working_channel);
    if (err == ESP_OK) {
        err = nvs_commit(handle);
    }
    nvs_close(handle);

    if (err == ESP_OK) {
        persisted_gateway_channel = working_channel;
        rtc_persisted_gateway_channel = working_channel;
        ESP_LOGI(TAG, "Persisted new gateway channel %u",
                 (unsigned int)working_channel);
    } else {
        ESP_LOGW(TAG, "Failed to persist gateway channel %u: %s",
                 (unsigned int)working_channel, esp_err_to_name(err));
    }
}

static void wifi_init(void)
{
    ESP_ERROR_CHECK(esp_netif_init());
    ESP_ERROR_CHECK(esp_event_loop_create_default());

    wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
    ESP_ERROR_CHECK(esp_wifi_init(&cfg));
    ESP_ERROR_CHECK(esp_wifi_set_storage(WIFI_STORAGE_RAM));

    // ESP-NOW uses the Wi-Fi radio, but this node does not connect to your router.
    ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));
    ESP_ERROR_CHECK(esp_wifi_start());

    uint8_t mac[ESP_NOW_ETH_ALEN];
    ESP_ERROR_CHECK(esp_wifi_get_mac(WIFI_IF_STA, mac));
    ESP_LOGI(TAG, "Node STA MAC: " MACSTR, MAC2STR(mac));
}

static void espnow_init(void)
{
    ESP_ERROR_CHECK(esp_now_init());
    ESP_ERROR_CHECK(esp_now_register_send_cb(on_espnow_send));
    ESP_ERROR_CHECK(esp_now_register_recv_cb(on_espnow_recv));

    esp_now_peer_info_t peer = {0};
    memcpy(peer.peer_addr, gateway_mac, ESP_NOW_ETH_ALEN);
    peer.channel = 0; // Use current Wi-Fi channel.
    peer.ifidx = WIFI_IF_STA;
    peer.encrypt = false;

    ESP_ERROR_CHECK(esp_now_add_peer(&peer));

    ESP_LOGI(TAG, "ESP-NOW initialized");
}

static bool send_with_confirmation(const void *data, size_t len)
{
    if (espnow_send_sem == NULL) {
        return false;
    }

    while (xSemaphoreTake(espnow_send_sem, 0) == pdTRUE) {
    }
    last_send_status = ESP_NOW_SEND_FAIL;

    esp_err_t err = esp_now_send(gateway_mac, data, len);
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "esp_now_send failed: %s", esp_err_to_name(err));
        return false;
    }

    if (xSemaphoreTake(espnow_send_sem,
                       pdMS_TO_TICKS(ESPNOW_SEND_TIMEOUT_MS)) != pdTRUE) {
        ESP_LOGW(TAG, "Timed out waiting for ESP-NOW send callback");
        return false;
    }

    return last_send_status == ESP_NOW_SEND_SUCCESS;
}

static bool send_sensor_packet(const sensor_packet_t *packet, uint8_t channel)
{
    esp_err_t err = esp_wifi_set_channel(channel, WIFI_SECOND_CHAN_NONE);
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "Failed to select channel %u: %s",
                 (unsigned int)channel, esp_err_to_name(err));
        return false;
    }
    vTaskDelay(pdMS_TO_TICKS(CHANNEL_SETTLE_MS));

    bool sent = send_with_confirmation(packet, sizeof(*packet));
    ESP_LOGI(TAG, "Sensor packet node=%lu sequence=%lu channel=%u: %s",
             (unsigned long)packet->node_id,
             (unsigned long)packet->sequence,
             (unsigned int)channel,
             sent ? "confirmed" : "failed");
    return sent;
}

static bool discover_and_send(const sensor_packet_t *packet,
                              uint8_t cached_channel,
                              uint8_t *working_channel)
{
    uint8_t channels[ESPNOW_US_CHANNEL_COUNT];
    size_t channel_count = espnow_build_channel_search_order(
        cached_channel, channels, sizeof(channels));

    ESP_LOGI(TAG, "Starting bounded gateway discovery across %u channels",
             (unsigned int)channel_count);

