DanielM718/ESP32-home-sensor-hub/esp/ESP32C3_SHT41_node/main/main.c
    for (size_t i = 0; i < channel_count; ++i) {
        const uint8_t candidate = channels[i];
        esp_err_t err = esp_wifi_set_channel(candidate, WIFI_SECOND_CHAN_NONE);
        if (err != ESP_OK) {
            ESP_LOGW(TAG, "Skipping channel %u: %s",
                     (unsigned int)candidate, esp_err_to_name(err));
            continue;
        }
        vTaskDelay(pdMS_TO_TICKS(CHANNEL_SETTLE_MS));

        while (xSemaphoreTake(discovery_response_sem, 0) == pdTRUE) {
        }
        const uint32_t nonce = esp_random();
        expected_discovery_nonce = nonce;
        discovered_gateway_channel = 0;
        discovery_response_expected = true;

        const espnow_discovery_request_t request = {
            .magic = ESPNOW_DISCOVERY_MAGIC,
            .version = ESPNOW_DISCOVERY_VERSION,
            .packet_type = ESPNOW_DISCOVERY_REQUEST,
            .reserved = 0,
            .node_id = NODE_ID,
            .nonce = nonce,
        };

        bool request_confirmed = send_with_confirmation(&request, sizeof(request));
        bool response_received = false;
        if (request_confirmed) {
            response_received =
                xSemaphoreTake(discovery_response_sem,
                               pdMS_TO_TICKS(DISCOVERY_RESPONSE_TIMEOUT_MS)) == pdTRUE;
        }
        discovery_response_expected = false;

        if (!response_received ||
            !espnow_channel_is_valid(discovered_gateway_channel)) {
            continue;
        }

        const uint8_t response_channel = discovered_gateway_channel;
        ESP_LOGI(TAG, "Gateway discovered on channel %u",
                 (unsigned int)response_channel);
        if (send_sensor_packet(packet, response_channel)) {
            *working_channel = response_channel;
            return true;
        }
    }

    ESP_LOGW(TAG, "Gateway discovery ended without a confirmed sensor send");
    return false;
}

static bool transmit_with_recovery(const sensor_packet_t *packet,
                                   uint8_t cached_channel,
                                   uint8_t *working_channel)
{
    if (espnow_channel_is_valid(cached_channel) &&
        send_sensor_packet(packet, cached_channel)) {
        *working_channel = cached_channel;
        return true;
    }

    return discover_and_send(packet, cached_channel, working_channel);
}

static void enter_deep_sleep(uint32_t seconds)
{
    const uint64_t sleep_interval_us = (uint64_t)seconds * UINT64_C(1000000);
    ESP_LOGI(TAG, "Entering deep sleep for %lu seconds", (unsigned long)seconds);
    ESP_ERROR_CHECK(esp_sleep_enable_timer_wakeup(sleep_interval_us));
    esp_deep_sleep_start();
}

static void enter_indefinite_deep_sleep(void)
{
    ESP_LOGW(TAG,
             "Low-battery shutdown confirmed: disabling all wakeup sources; timed wakeup is disabled");
    esp_err_t err = esp_sleep_disable_wakeup_source(ESP_SLEEP_WAKEUP_ALL);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to disable deep-sleep wakeup sources: %s", esp_err_to_name(err));
    }
    ESP_LOGW(TAG, "Entering indefinite deep sleep; external reset or power cycle is required");
    esp_deep_sleep_start();
}

void app_main(void)
{
    gpio_reset_pin(USER_LED_GPIO);
    gpio_set_direction(USER_LED_GPIO, GPIO_MODE_OUTPUT);
    gpio_set_level(USER_LED_GPIO, 0); // XIAO ESP32-C3 D10 LED off

    esp_err_t err = nvs_flash_init();
    if (err == ESP_ERR_NVS_NO_FREE_PAGES || err == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        err = nvs_flash_init();
    }
    ESP_ERROR_CHECK(err);

    const uint8_t cached_gateway_channel = load_gateway_channel();

    espnow_send_sem = xSemaphoreCreateBinary();
    discovery_response_sem = xSemaphoreCreateBinary();
    if (espnow_send_sem == NULL || discovery_response_sem == NULL) {
        ESP_LOGE(TAG, "Failed to allocate bounded ESP-NOW synchronization");
        recovery_failure_count =
            espnow_recovery_failure_count(recovery_failure_count, false);
        enter_deep_sleep(
            espnow_recovery_sleep_seconds(recovery_failure_count));
    }

    uint16_t measured_battery_mv = 0;
    esp_err_t battery_err = ESP_ERR_NOT_SUPPORTED;

#if BATTERY_MONITOR_ENABLED
    battery_err = battery_read_mv(&measured_battery_mv);
    if (battery_err != ESP_OK) {
        ESP_LOGE(TAG, "Battery measurement failed; reporting unavailable: %s",
                 esp_err_to_name(battery_err));
    }
#else
    ESP_LOGI(TAG, "Battery monitoring disabled for this node");
#endif

    wifi_init();
    espnow_init();
    err = i2c_init();
    bool i2c_ready = (err == ESP_OK);
    if (!i2c_ready) {
        ESP_LOGE(TAG, "I2C init failed: %s", esp_err_to_name(err));
    } else {
        err = sht41_probe();
        if (err != ESP_OK) {
            ESP_LOGW(TAG, "Continuing after SHT41 probe failure to capture read-stage errors");
        }
    }

    sensor_packet_t packet = {
        .node_id = NODE_ID,
        .sequence = sequence_number++,
        .temp_c = 0.0f,
        .rh = 0.0f,
        .battery_mv = 0,
        .status_flags = STATUS_ESPNOW_SEND_ATTEMPTED,
    };
    bool low_battery_shutdown = false;

    if (battery_err == ESP_OK) {
        packet.battery_mv = measured_battery_mv;
        packet.status_flags |= STATUS_BATTERY_OK;
    }

    if (battery_err == ESP_OK &&
        (packet.status_flags & STATUS_BATTERY_OK) != 0 &&
        packet.battery_mv != 0) {
        if (packet.battery_mv <= BATTERY_ABSOLUTE_MIN_MV) {
            ESP_LOGE(TAG,
                     "Battery at or below EVE cell absolute discharge cutoff: %u mV (cutoff=%u mV)",
                     (unsigned int)packet.battery_mv,
                     (unsigned int)BATTERY_ABSOLUTE_MIN_MV);
        }

        if (packet.battery_mv < BATTERY_LOW_MV) {
            packet.status_flags |= STATUS_BATTERY_LOW;
            ESP_LOGW(TAG, "Battery low: %u mV (warning threshold=%u mV)",
                     (unsigned int)packet.battery_mv, (unsigned int)BATTERY_LOW_MV);
        }

        if (packet.battery_mv <= BATTERY_SHUTDOWN_MV) {
            if (low_battery_reading_count < BATTERY_LOW_CONFIRMATION_COUNT) {
                low_battery_reading_count++;
            }
            ESP_LOGW(TAG,
                     "Battery shutdown confirmation %u/%u: %u mV (threshold=%u mV)",
                     (unsigned int)low_battery_reading_count,
                     (unsigned int)BATTERY_LOW_CONFIRMATION_COUNT,
                     (unsigned int)packet.battery_mv,
                     (unsigned int)BATTERY_SHUTDOWN_MV);
        } else {
            if (low_battery_reading_count != 0) {
                ESP_LOGI(TAG, "Battery recovered above shutdown threshold; confirmation count reset");
            }
            low_battery_reading_count = 0;
        }

        if (low_battery_reading_count >= BATTERY_LOW_CONFIRMATION_COUNT) {
            packet.status_flags |= STATUS_BATTERY_SHUTDOWN;
            low_battery_shutdown = true;
            ESP_LOGW(TAG,
                     "Low-battery shutdown confirmed; this cycle will send the final packet before indefinite sleep");
        }
    } else if (battery_err == ESP_OK &&
               (packet.status_flags & STATUS_BATTERY_OK) != 0 &&
               packet.battery_mv == 0) {
        ESP_LOGE(TAG, "Battery measurement returned zero; shutdown evaluation skipped");
    }

    float temp_c = 0.0f;
    float rh = 0.0f;
    err = i2c_ready ? sht41_read(&temp_c, &rh) : ESP_ERR_INVALID_STATE;
    if (err == ESP_OK) {
        packet.temp_c = temp_c;
        packet.rh = rh;
        packet.status_flags |= STATUS_SHT41_OK;
        ESP_LOGI(TAG, "SHT41: %.2f C, %.2f %%RH", packet.temp_c, packet.rh);
    } else {
        ESP_LOGE(TAG, "SHT41 read failed: %s", esp_err_to_name(err));
    }

    uint8_t working_channel = 0;
    const bool communication_succeeded =
        transmit_with_recovery(&packet, cached_gateway_channel, &working_channel);
    recovery_failure_count = espnow_recovery_failure_count(
        recovery_failure_count, communication_succeeded);

    uint32_t next_sleep_seconds = NORMAL_SLEEP_SECONDS;
    if (communication_succeeded) {
        cache_gateway_channel(working_channel);
        ESP_LOGI(TAG, "Communication succeeded; recovery backoff reset");
    } else {
        next_sleep_seconds =
            espnow_recovery_sleep_seconds(recovery_failure_count);
        ESP_LOGW(TAG, "Communication failure %u; retry after %lu seconds",
                 (unsigned int)recovery_failure_count,
                 (unsigned long)next_sleep_seconds);
    }

    vTaskDelay(pdMS_TO_TICKS(50));
    if (low_battery_shutdown) {
        enter_indefinite_deep_sleep();
    } else {
        enter_deep_sleep(next_sleep_seconds);
    }
}
